app/controllers/hangman_controller.rb

SELECT `dictionaries`.* FROM `dictionaries` WHERE `dictionaries`.`id` = 2 LIMIT 1
SELECT `dictionaries`.* FROM `dictionaries` ORDER BY RAND() LIMIT 1
---
  def index
 session[:string_entered]=""
 @abc = ""

 @simplew=Dictionary.find(:all,:order => 'RAND()',:limit => 1)  #fetch a random record from dictionary table
 session[:word]=@simplew.first.word